/*---------------------------------------------------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/*---------------------------------------------------------------------*/

/*************	功能说明	**************

本例程基于AI8051U为主控芯片的实验箱进行编写测试。

使用Keil C251编译器，Memory Model推荐设置XSmall模式，默认定义变量在edata，单时钟存取访问速度快。

edata建议保留1K给堆栈使用，空间不够时可将大数组、不常用变量加xdata关键字定义到xdata空间。

USB-[键盘+鼠标] 的复合设备例程

按住P3.5(T1)，按键0～7为鼠标功能
按键0：鼠标左键
按键1：鼠标中键
按键2：鼠标右键
按键4：光标左移
按键5：光标右移
按键6：光标上移
按键7：光标下移

松开P3.5(T1)，按键0～7为键盘功能
按键0～7分别输入数字1～8
P4.3(LED10)：NUM 指示灯
P4.2(LED11)：CAPS 指示灯

下载时, 选择时钟 24MHZ (用户可自行修改频率).

******************************************/

#include "stc.h"
#include "usb.h"
#include "usb_req_class.h"
#include "timer.h"

void main()
{
    WTST = 0;  //设置程序指令延时参数，赋值为0可将CPU执行指令的速度设置为最快
    EAXFR = 1; //扩展寄存器(XFR)访问使能
    CKCON = 0; //提高访问XRAM速度

    usb_init();
    timer_init();

    EA = 1;
    
    while (1)
    {
        usb_class_in();
        
        if (f1ms)
        {
            f1ms = 0;
            scan_keyboard();
            scan_mouse();
        }
    }
}
