/*---------------------------------------------------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/*---------------------------------------------------------------------*/

#ifndef __CONFIG_H
#define __CONFIG_H

//========================================================================
//                               主时钟定义
//========================================================================

//#define MAIN_Fosc		40000000L	//定义主时钟
#define MAIN_Fosc		24000000L	//定义主时钟
//#define MAIN_Fosc		22118400L	//定义主时钟
//#define MAIN_Fosc		12000000L	//定义主时钟
//#define MAIN_Fosc		11059200L	//定义主时钟
//#define MAIN_Fosc		 5529600L	//定义主时钟

//设置系统等待时间单元，用于控制EEPROM操作、SPI/I2C超时时间以及休眠唤醒等待时间
#define SET_TPS()       IAP_TPS = (MAIN_Fosc / 1000000L)
//设置IRC时钟从休眠唤醒恢复稳定需要等待的时钟数，初始值: 0x80，高频建议设置: 0x10
#define IRC_Debounce(n) IRCDB = n

//========================================================================
//                                头文件
//========================================================================

#include "type_def.h"
#include "ai8051u.h"
#include "intrins.h"
#include <stdlib.h>
#include <stdio.h>

//========================================================================
//                             外部函数和变量声明
//========================================================================


#endif
