/*---------------------------------------------------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/*---------------------------------------------------------------------*/

#include "AI8051U_QSPI.h"

//========================================================================
// 函数: QSPI_ISR_Handler
// 描述: QSPI中断函数.
// 参数: none.
// 返回: none.
// 版本: V1.0, 2025-02-10
//========================================================================
void QSPI_ISR_Handler (void) interrupt QSPI_VECTOR
{
    if(QSPI_SR1 & 0x01)     //传输错误标志 TEF
    {
        QSPI_FCR |= 0x01;   //写 1 清除 TEF 标志位
        
        // TODO: 在此处添加用户代码
    }

    if(QSPI_SR1 & 0x02)     //传输完成标志 TCF
    {
        QSPI_FCR |= 0x02;   //写 1 清除 TCF 标志位
        
        // TODO: 在此处添加用户代码
    }

    if(QSPI_SR1 & 0x08)     //状态匹配标志 CSMF
    {
        QSPI_FCR |= 0x08;   //写 1 清除 CSMF 标志位
        
        // TODO: 在此处添加用户代码
    }
}
